class MockContent {

    public static Topic[][] get() {
        var topics = new[] {
            new[] {
                new Topic("-ЛОЛ-", new[] {
                    new Question("Класс аниме персонажей", "Лоли", 10),
                    new Question("Феномен, возникающий на улицах в результате заморозков", "Гололед", 20),
                    new Question("Дисциплина, изучающая язык", "Филология", 30),
                    new Question("Препарат для сердечников, запрещенный ко ввозу в США", "Карвалол", 40),
                    new Question("Известный летсплеер по майнкрафту", "mrlololoshka", 50),
                }),
                new Topic("Духовная", new[] {
                    new Question("Перечислите всех шестерых духов из Dota 2", "Венга, Бара, Эмбер, Дебил, Шторм, Воид",
                        10),
                    new Question(
                        "Именно этот персонаж чуть не задушил имперского офицера за оскорбление его древней религии",
                        "Дарт Вейдер", 20),
                    new Question(
                        "Особым образом согнутый отрезок металлической проволоки длиной около 7 — 10 сантиметров, использующийся в канцелярии",
                        "Скрепка", 30),
                    new Question("Автор \"Феноменологии Духа\"", "Гегель", 40),
                    new Question("Вера в одухотворенность неживых предметов", "Анимизм", 50),
                }),
                new Topic("Духовная", new[] {
                    new Question("Перечислите всех шестерых духов из Dota 2", "Венга, Бара, Эмбер, Дебил, Шторм, Воид",
                        10),
                    new Question(
                        "Именно этот персонаж чуть не задушил имперского офицера за оскорбление его древней религии",
                        "Дарт Вейдер", 20),
                    new Question(
                        "Особым образом согнутый отрезок металлической проволоки длиной около 7 — 10 сантиметров, использующийся в канцелярии",
                        "Скрепка", 30),
                    new Question("Автор \"Феноменологии Духа\"", "Гегель", 40),
                    new Question("Вера в одухотворенность неживых предметов", "Анимизм", 50),
                }),
                new Topic("-ЛОЛ-", new[] {
                    new Question("Класс аниме персонажей", "Лоли", 10),
                    new Question("Феномен, возникающий на улицах в результате заморозков", "Гололед", 20),
                    new Question("Дисциплина, изучающая язык", "Филология", 30),
                    new Question("Препарат для сердечников, запрещенный ко ввозу в США", "Карвалол", 40),
                    new Question("Известный летсплеер по майнкрафту", "mrlololoshka", 50),
                }),
            },
            
            new[] {
                new Topic("-ЛОЛ-", new[] {
                    new Question("Класс аниме персонажей", "Лоли", 10),
                    new Question("Феномен, возникающий на улицах в результате заморозков", "Гололед", 20),
                    new Question("Дисциплина, изучающая язык", "Филология", 30),
                    new Question("Препарат для сердечников, запрещенный ко ввозу в США", "Карвалол", 40),
                    new Question("Известный летсплеер по майнкрафту", "mrlololoshka", 50),
                }),
                new Topic("Духовная", new[] {
                    new Question("Перечислите всех шестерых духов из Dota 2", "Венга, Бара, Эмбер, Дебил, Шторм, Воид",
                        10),
                    new Question(
                        "Именно этот персонаж чуть не задушил имперского офицера за оскорбление его древней религии",
                        "Дарт Вейдер", 20),
                    new Question(
                        "Особым образом согнутый отрезок металлической проволоки длиной около 7 — 10 сантиметров, использующийся в канцелярии",
                        "Скрепка", 30),
                    new Question("Автор \"Феноменологии Духа\"", "Гегель", 40),
                    new Question("Вера в одухотворенность неживых предметов", "Анимизм", 50),
                }),
                new Topic("Духовная", new[] {
                    new Question("Перечислите всех шестерых духов из Dota 2", "Венга, Бара, Эмбер, Дебил, Шторм, Воид",
                        10),
                    new Question(
                        "Именно этот персонаж чуть не задушил имперского офицера за оскорбление его древней религии",
                        "Дарт Вейдер", 20),
                    new Question(
                        "Особым образом согнутый отрезок металлической проволоки длиной около 7 — 10 сантиметров, использующийся в канцелярии",
                        "Скрепка", 30),
                    new Question("Автор \"Феноменологии Духа\"", "Гегель", 40),
                    new Question("Вера в одухотворенность неживых предметов", "Анимизм", 50),
                }),
                new Topic("-ЛОЛ-", new[] {
                    new Question("Класс аниме персонажей", "Лоли", 10),
                    new Question("Феномен, возникающий на улицах в результате заморозков", "Гололед", 20),
                    new Question("Дисциплина, изучающая язык", "Филология", 30),
                    new Question("Препарат для сердечников, запрещенный ко ввозу в США", "Карвалол", 40),
                    new Question("Известный летсплеер по майнкрафту", "mrlololoshka", 50),
                }),
            }
        };
        return topics;
    }
}
